arduino/Arduino/build/linux/arduino-1.8.14/hardware/tools/avr/avr/include/avr/iom324pb.h
#define UCSR2B  _SFR_MEM8(0xD1)

#define UCSR2C  _SFR_MEM8(0xD2)

#define UCSR2D  _SFR_MEM8(0xD3)

/* Combine UBRR2L and UBRR2H */
#define UBRR2   _SFR_MEM16(0xD4)

#define UBRR2L  _SFR_MEM8(0xD4)
#define UBRR2H  _SFR_MEM8(0xD5)

#define UDR2    _SFR_MEM8(0xD6)

/* Reserved [0xD7] */

#define TWBR1   _SFR_MEM8(0xD8)

#define TWSR1   _SFR_MEM8(0xD9)

#define TWAR1   _SFR_MEM8(0xDA)

#define TWDR1   _SFR_MEM8(0xDB)

#define TWCR1   _SFR_MEM8(0xDC)

#define TWAMR1  _SFR_MEM8(0xDD)
#define TWAM10  1
#define TWAM11  2
#define TWAM12  3
#define TWAM13  4
#define TWAM14  5
#define TWAM15  6
#define TWAM16  7



/* Values and associated defines */


#define SLEEP_MODE_IDLE (0x00<<1)
#define SLEEP_MODE_ADC (0x01<<1)
#define SLEEP_MODE_PWR_DOWN (0x02<<1)
#define SLEEP_MODE_PWR_SAVE (0x03<<1)
#define SLEEP_MODE_STANDBY (0x06<<1)
#define SLEEP_MODE_EXT_STANDBY (0x07<<1)

/* Interrupt vectors */
/* Vector 0 is the reset vector */
/* External Interrupt Request 0 */
#define INT0_vect            _VECTOR(1)
#define INT0_vect_num        1

/* External Interrupt Request 1 */
#define INT1_vect            _VECTOR(2)
#define INT1_vect_num        2

/* External Interrupt Request 2 */
#define INT2_vect            _VECTOR(3)
#define INT2_vect_num        3

/* Pin Change Interrupt Request 0 */
#define PCINT0_vect            _VECTOR(4)
#define PCINT0_vect_num        4

/* Pin Change Interrupt Request 1 */
#define PCINT1_vect            _VECTOR(5)
#define PCINT1_vect_num        5

/* Pin Change Interrupt Request 2 */
#define PCINT2_vect            _VECTOR(6)
#define PCINT2_vect_num        6

/* Pin Change Interrupt Request 3 */
#define PCINT3_vect            _VECTOR(7)
#define PCINT3_vect_num        7

/* Watchdog Time-out Interrupt */
#define WDT_vect            _VECTOR(8)
#define WDT_vect_num        8

/* Timer/Counter2 Compare Match A */
#define TIMER2_COMPA_vect            _VECTOR(9)
#define TIMER2_COMPA_vect_num        9

/* Timer/Counter2 Compare Match B */
#define TIMER2_COMPB_vect            _VECTOR(10)
#define TIMER2_COMPB_vect_num        10

/* Timer/Counter2 Overflow */
#define TIMER2_OVF_vect            _VECTOR(11)
#define TIMER2_OVF_vect_num        11

/* Timer/Counter1 Capture Event */
#define TIMER1_CAPT_vect            _VECTOR(12)
#define TIMER1_CAPT_vect_num        12

/* Timer/Counter1 Compare Match A */
#define TIMER1_COMPA_vect            _VECTOR(13)
#define TIMER1_COMPA_vect_num        13

/* Timer/Counter1 Compare Match B */
#define TIMER1_COMPB_vect            _VECTOR(14)
#define TIMER1_COMPB_vect_num        14

/* Timer/Counter1 Overflow */
#define TIMER1_OVF_vect            _VECTOR(15)
#define TIMER1_OVF_vect_num        15

/* Timer/Counter0 Compare Match A */
#define TIMER0_COMPA_vect            _VECTOR(16)
#define TIMER0_COMPA_vect_num        16

/* Timer/Counter0 Compare Match B */
#define TIMER0_COMPB_vect            _VECTOR(17)
#define TIMER0_COMPB_vect_num        17

/* Timer/Counter0 Overflow */
#define TIMER0_OVF_vect            _VECTOR(18)
#define TIMER0_OVF_vect_num        18

/* SPI0 Serial Transfer Complete */
#define SPI0_STC_vect            _VECTOR(19)
#define SPI0_STC_vect_num        19

/* USART0 Rx Complete */
#define USART0_RX_vect            _VECTOR(20)
#define USART0_RX_vect_num        20

/* USART0 Data register Empty */
#define USART0_UDRE_vect            _VECTOR(21)
#define USART0_UDRE_vect_num        21

/* USART0 Tx Complete */
#define USART0_TX_vect            _VECTOR(22)
#define USART0_TX_vect_num        22

/* Analog Comparator */
#define ANALOG_COMP_vect            _VECTOR(23)
#define ANALOG_COMP_vect_num        23

/* ADC Conversion Complete */
#define ADC_vect            _VECTOR(24)
#define ADC_vect_num        24

/* EEPROM Ready */
#define EE_READY_vect            _VECTOR(25)
#define EE_READY_vect_num        25

/* 2-wire Serial Interface 0 */
#define TWI0_vect            _VECTOR(26)
#define TWI0_vect_num        26

/* Store Program Memory Read */
#define SPM_READY_vect            _VECTOR(27)
#define SPM_READY_vect_num        27

/* USART1 RX complete */
#define USART1_RX_vect            _VECTOR(28)
#define USART1_RX_vect_num        28

/* USART1 Data Register Empty */
#define USART1_UDRE_vect            _VECTOR(29)
#define USART1_UDRE_vect_num        29

/* USART1 TX complete */
#define USART1_TX_vect            _VECTOR(30)
#define USART1_TX_vect_num        30

/* Timer/Counter3 Capture Event */
#define TIMER3_CAPT_vect            _VECTOR(31)
#define TIMER3_CAPT_vect_num        31

/* Timer/Counter3 Compare Match A */
#define TIMER3_COMPA_vect            _VECTOR(32)
#define TIMER3_COMPA_vect_num        32

/* Timer/Counter3 Compare Match B */
#define TIMER3_COMPB_vect            _VECTOR(33)
#define TIMER3_COMPB_vect_num        33

/* Timer/Counter3 Overflow */
#define TIMER3_OVF_vect            _VECTOR(34)
#define TIMER3_OVF_vect_num        34

/* USART0 RX start edge detect */
#define USART0_RXS_vect            _VECTOR(35)
#define USART0_RXS_vect_num        35

/* USART0 RX start edge detect */
#define USART0_START_vect            _VECTOR(35)
#define USART0_START_vect_num        35

/* USART1 RX start edge detect */
#define USART1_RXS_vect            _VECTOR(36)
#define USART1_RXS_vect_num        36

/* USART1 RX start edge detect */
#define USART1_START_vect            _VECTOR(36)
#define USART1_START_vect_num        36

/* Pin Change Interrupt Request 4 */
#define PCINT4_vect            _VECTOR(37)
#define PCINT4_vect_num        37

/* Crystal failure detect */
#define XOSCFD_vect            _VECTOR(38)
#define XOSCFD_vect_num        38

/* PTC end of conversion */
#define PTC_EOC_vect            _VECTOR(39)
#define PTC_EOC_vect_num        39

/* PTC window comparator interrupt */
#define PTC_WCOMP_vect            _VECTOR(40)
#define PTC_WCOMP_vect_num        40

/* SPI1 Serial Transfer Complete */
#define SPI1_STC_vect            _VECTOR(41)
#define SPI1_STC_vect_num        41

/* 2-wire Serial Interface 1 */
#define TWI1_vect            _VECTOR(42)
#define TWI1_vect_num        42

/* Timer/Counter4 Capture Event */
#define TIMER4_CAPT_vect            _VECTOR(43)
#define TIMER4_CAPT_vect_num        43

